<?php

use Illuminate\Database\Seeder;
use App\Models\QuarantineMeasure;

class QuarantineMeasuresTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = $this->getData();

        foreach($data as $key => $item) {
        	QuarantineMeasure::create($item);
        }
        
    }

    public function getData() {
    	return array(
    		// array(
	    	// 	'user_id' => 1,
	    	// 	'title' => '',
	    	// 	'sub_title' => '',
	    	// 	'description' => "",
	    	// 	'image_id' => null,
	    	// 	'type_id' => null,
	    	// 	'position' => null,
	    	// 	'status' => 1,
    		// ),
    		array(
	    		'user_id' => 1,
	    		'title' => 'Карантинні заходи у місті',
	    		'sub_title' => '',
	    		'description' => 
"В умовах карантину згідно чинної Постанови №211 обов'язково:
	- Мати при собі документи
	- Бути у масці чи респіраторі в усіх громадських місцях
	- Пересуватися у кількості не більше двох осіб
	- Особи віком старше 60 років, якщо не мають близьких осіб молодшого віку можуть пересуватися на відстані не далі 2 км від місця проживання
	- Діти до 14 років рекомендовано виходити на вулицю тільки у супроводі батьків чи опікунів. Але не більше однієї дорослої особи.
	- Відвідування парків, скверів, зон відпочинку, лісопаркових та прибережних зон забороняється. Це дозволяється лише у випадку, якщо вам потрібно вигуляти домашню тварину та лише однією людиною.",
	    		'image_id' => null,
	    		'type_id' => null,
	    		'position' => null,
	    		'status' => 1,
    		),
    		array(
	    		'user_id' => 1,
	    		'title' => 'Чому запровадили правило носити з собою документи, що посвідчують особу?',
	    		'sub_title' => '',
	    		'description' => "Наявність у людини документів дозволить перевірити, чи не мусить вона бути на самоізоляції, або вобсервації. А також це дасть можливість органам правопорядку застосовувати адміністративну відповідальність для порушників правил карантину.",
	    		'image_id' => null,
	    		'type_id' => null,
	    		'position' => null,
	    		'status' => 1,
    		),
    		array(
	    		'user_id' => 1,
	    		'title' => 'Чи можна ходити по вулиці без маски?',
	    		'sub_title' => '',
	    		'description' => 
"В постанові №211 сказано, що в усіх громадських місцях ви маєте бути в масці чи респіраторі.

Громадське місце - частина будь-якої споруди, яка доступна або відкрита для населення, в тому числі за плату (під'їзди, підземні переходи, стадіони; парки, сквери, дитячі майданчики, стадіони, зупинки громадського транспорту, ліфти, державні установи, медичні установи та інше).

Але! Перелік громадських місць може бути розширений органами місцевої влади. Наприклад, у м. Києві до громадських місць відносяться також зупинки громадського транспорту та 50-метрова зона навколо них; церкви та 50-метрова зона навколо них; заклади торгівлі закритого і відкритого типів, зокрема торгові ряди та ринки; кінотеатри та прилегла до них територія тощо.

Тому ми наполегливо рекомендуємо перебувати на вулиці в масці, оскільки у будь-який момент можете опинитись на території, яка підпадає під визначення «громадське місце».",
	    		'image_id' => null,
	    		'type_id' => null,
	    		'position' => null,
	    		'status' => 1,
    		),
    		array(
	    		'user_id' => 1,
	    		'title' => 'Навіщо запроваджується обов’язковий масковий режим?',
	    		'sub_title' => '',
	    		'description' => "Це потрібно заради безпеки всіх нас. Враховуючи темпи розповсюдження коронавірусної хвороби, всі люди розглядаються як потенційно інфіковані. Ви можете не знати, що є переносником вірусу, проте можете наражати на небезпеку інших. Маска запобігає можливому інфікуванню оточуючих. Коли маска на обличчі, тоді виділення біологічного матеріалу, який може містити збудник, зменшується.",
	    		'image_id' => null,
	    		'type_id' => null,
	    		'position' => null,
	    		'status' => 1,
    		),
    		array(
	    		'user_id' => 1,
	    		'title' => 'Яка відповідальність за порушення правил карантину? Чи можуть мене оштрафувати за похід в парк чи відсутність маски?',
	    		'sub_title' => '',
	    		'description' => "Можуть. За порушення правил карантину – штраф від 17 тис. грн до 34 тис. грн. А якщо ви порушуєте санітарні правила та норми щодо запобігання інфекційним захворюванням, може бути й кримінальна відповідальність.",
	    		'image_id' => null,
	    		'type_id' => null,
	    		'position' => null,
	    		'status' => 1,
    		),
    	);
    }
}
